Tekla Open API Reference for Tekla Structures 2025
GuidConversion Class
 Conversion of old TS GUIDs to current GUIDs. GUIDs are changed in TS save as operation, this class can be used to convert old GUIDs to current GUIDs. To recognize the need for GUID conversion, application needs to save project GUID and compare to the current project GUID. Note: With big models the instance uses a lot of memory.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Operations.GuidConversion
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class GuidConversion
Public Class GuidConversion
The GuidConversion type exposes the following members.
Constructors
Name | Description
GuidConversion
Initializes a new instance of the GuidConversion class.
Top
Methods
Name | Description
GetGuidMapping
Gets the GUID mapping.
GetNewGuid
Gets the new GUID.
Top
See Also
Reference
Tekla.Structures.Model.Operations Namespace